package com.samul.javaсorelessons.lesson5;

/*2. Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран слово «yes», в противном
случае – слово «no»
*/
public class Condition2 {
	public static void main(String[] args) {

		if (1 < 2) {
			System.out.println("YES");
		} else {
			System.out.println("NO");
		}
	}

}
